[{"bookName":"Opening Spaces: An Anthology of Contemporary African Women's Writing","author":"Yvonne Vera (Editor), Yvonne Vera","ISBN_API":9780435910105,"year":"September 1999","description":"In this anthology the award-winning author Yvonne Vera brings together the stories of many talented writers from different parts of Africa."},{"bookName":"The Caine Prize for African Writing 2010: 11th Annual Collection","author":"The Caine Prize for African Writing","ISBN_API":9781906523374,"year":"August 2010","description":"<p>The Caine Prize for African Writing is Africa's leading literary prize. For the past ten years it has supported and promoted contemporary African writing. Previous winners and entrants include Chimamanda Ngozi Adichie, Segun Afolabi, EC Osondu, Leila Aboulela, Brian Chikwava, Henrietta Rose-Innes, Mary Watson, and Binyavanga Wainaina.</p>\n<p>The 2010 collection will include the shortlisted stories and the stories written at the Caine Prize Writers' Workshop. It will be published in time for the announcement of the award in July 2010.</p>"},{"bookName":"African Folktales","author":"Roger D. Abrahams, Dan Frank","ISBN_API":9780394721170,"year":"August 1983","description":""},{"bookName":"Unchained Voices: An Anthology of Black Authors in the English-Speaking World of the Eighteenth Century","author":"Vincent Carretta","ISBN_API":9780813190761,"year":"December 2003","description":"Vincent Carretta has assembled the most comprehensive anthology ever published of writings by eighteenth-century people of African descent, capturing the surprisingly diverse experiences of blacks on both sides of the Atlantic--America, Britain, the West Indies, and Africa--between 1760 and 1798."},{"bookName":"Women Writing Africa: West Africa and the Sahel","author":"Esi Sutherland-Addy (Editor), Abena P. A. Busia (Editor), Aminata Diaw","ISBN_API":9781558615007,"year":"August 2005","description":"<p>The acclaimed Women Writing Africa project “opens up worlds too often excluded from the history books” (<i>Booklist</i>) and is an “essential resource for scholars and general readers alike” (<i>Library Journal</i>). It reveals the cultural legacy of African women in their own words, in never-before- published texts that include communal songs and lullabies, letters and speeches, poetry and fiction.</p>\n<p>Representing 20 languages and 12 countries, volume 2 covers western Africa, where most African Americans find their roots. The collection presents an epic history of the region through the eyes of its women, from the age of African kings through colonialism and independence.</p>\n<p>Volume 1 of the series, <i>Women Writing Africa: The Southern Region</i>, is also available; volumes 3 and 4 will be published in 2006.</p>"},{"bookName":"10 Years of the Caine Prize for African Writing: Plus Coetzee, Gordimer, Achebe, Okri","author":"The Caine The Caine Prize for African Writing","ISBN_API":9781906523244,"year":"September 2009","description":""},{"bookName":"Introduction to African Oral Literature and Performance","author":"Bayo Ogunjimi, Abdul Rasheed Na'allah","ISBN_API":9781592211517,"year":"February 2006","description":"This new book puts together in a single cover, two earlier volumes by the authors, now revised to meet the challenges of a twenty-first century scholarship in African performance and cultural studies. Topics covered range from sources of African oral traditions, relevance of cosmology to African oral performance, fieldwork practice and research methodology, archetypes, folktales, myths and legends, performance and stylistic features, to various areas of poetic performances like praise poetry, religious poetry, topical, occupational and heroic poetry, their performances and more. The central theme of the book is performance, and students, scholars and readers are provided with projects and exercises intended to keep them involved in research and performance experience of the oral forms. Teaching and curriculum development suggestions are given to teachers of African oral performances. Important information is provided to guide researchers into a continued exciting experience in the study of and research into African oral traditions. Materials are included from a good number of languages and cultures of Africa including Yoruba, Hausa, Nupe, among others, so that students would be able to explore these important examples as testimony of the richness of the scholarly and cultural resources in African oral traditions."},{"bookName":"Violence in Francophone African and Caribbean Women's Literature","author":"Marie-Chantal Kalisa","ISBN_API":9780803211025,"year":"December 2009","description":"African and Caribbean peoples share a history dominated by the violent disruptions of slavery and colonialism. While much has been said about these “geographies of pain,” violence in the private sphere, particularly gendered violence, receives little attention. This book fills that void. It is a critical addition to the study of African and Caribbean women’s literatures at a time when women from these regions are actively engaged in articulating the ways in which colonial and postcolonial violence impact women.&nbsp;Chantal Kalisa examines the ways in which women writers lift taboos imposed on them by their society and culture and challenge readers with their unique perspectives on violence. Comparing women from different places and times, Kalisa treats types of violence such as colonial, familial, linguistic, and war-related, specifically linked to dictatorship and genocide. She examines Caribbean writers Michele Lacrosil, Simone Schwartz-Bart, Gisèle Pineau, and Edwidge Danticat, and Africans Ken Begul, Calixthe Beyala, Nadine Bar, and Monique Ilboudo. She also includes Sembène Ousmane and Frantz Fanon for their unique contributions to the questions of violence and gender. This study advances our understanding of the attempts of African and Caribbean women writers to resolve the tension between external forms of violence and internal forms resulting from skewed cultural, social, and political rules based on gender."},{"bookName":"Oral Epics from Africa","author":"John William Johnson, Thomas A. Hale, Stephen (Eds.) Belcher, Thomas A. Hale (Editor), Stephen Belcher","ISBN_API":9780253211101,"year":"March 2008","description":""},{"bookName":"African Fundamentalism: A Literary and Cultural Anthology of Garvey's Harlem Renaissance","author":"Tony Martin","ISBN_API":9780912469096,"year":"October 1991","description":""},{"bookName":"Land Apart: A South African Reader","author":"Various, Andre Brink, J. M. Coetzee","ISBN_API":9780140100044,"year":"June 1987","description":""},{"bookName":"Women Writing Africa: The Eastern Region","author":"Amandina Lihamba (Editor), Fulata L. Moyo (Editor), Mugaybuso M. Mulokozi","ISBN_API":9781558615342,"year":"February 2007","description":""},{"bookName":"Nobody Ever Said AIDS: Poems and Stories from Southern Africa","author":"Nobantu Rasebotsa (Editor), Kylie Thomas (Editor), Meg Samuelson (Editor), Njabulo S. Ndebele","ISBN_API":9780795701849,"year":"March 2010","description":"While numerous texts have dealt with the AIDS pandemic in Africa from the clinical, economic, and sociological to the academic and technical this anthology of poems and short stories connects on a human level and reflects an entire society dealing with the challenges of overcoming AIDS and HIV. Well-known writers such as Achmat Dangor, Dambudzo Marechera, and Sindiwe Magona join 16 new writers selected from the \"Share Your Story about HIV/AIDS\" creative writing competition funded by the Swedish donor foundation, SIDA, and conducted in collaboration with the University of Cape Town. Their intimate stories and poems explore love, sexuality, stigma, and loss, bearing witness to the disease and responding to its silent taboo."},{"bookName":"Step into a World: A Global Anthology of the New Black Literature","author":"Kevin Powell (Editor), Powell","ISBN_API":9780471380603,"year":"October 2000","description":"<p>Step Into A World</p>\n<p>\"Kevin Powell is pushing to bring, as he has so brilliantly done before, the voices of his generation: the concerns, the cares, the fears, and the fearlessness. Step into a World is a kaleidoscope into the world not bound by artificial constructs like nation. John Coltrane recorded ‘Giant Steps,’ which is a riff on the sight and sounds in his muse. Powell plays the computer with equal astuteness.\" Nikki Giovanni</p>\n<p>\"Those of us who pay attention were aware that the younger generation of black writers was being smothered by the anointment of talented tenth Divas and Divuses, and their commercial accommodationist ‘Fourth Renaissance. ’This anthology is indeed a breakthrough! It combines the boldness and daring of hip-hop with the intellectual keenness of a Michele Wallace or a Clyde Taylor.\" Ishmael Reed</p>\n<p>\"In a culture where videos, the Internet, and other high-tech communication is being consumed like the latest mind-altering drug, how does great literature grow and survive? These writers will answer that all-important question. This anthology provides a clue, a hint, as to where we might be going. They are resisting all this vacant, empty-minded nothingness. Read them. Listen to them. If you don’t, you do so at your peril.\" Quincy Troupe</p>"},{"bookName":"An Anthology of Interracial Literature: Black-White Contacts in the Old World and the New","author":"Werner Sollors, Werner Sollors","ISBN_API":9780814781432,"year":"February 2004","description":""},{"bookName":"The Caine Prize 2009: The Caine Prize for African Writing 10th Annual Collection","author":"New Internationalist","ISBN_API":9781906523145,"year":"July 2009","description":"<p><b>The Caine Prize for African Writing</b> is Africa’s leading literary prize and is awarded to a short story by an African writer published in English, whether in Africa or elsewhere. This edition collects the five 2009 shortlisted stories, along with twelve stories written at the Caine Prize Writers’ Workshop, taking place in spring 2009.</p>\n<p>Previous winners and entrants include Segun Afolabi, Leila Aboulela, Chimamanda Ngozi Adichie, Brian Chikwava, Henrietta Rose-Innes, Mary Watson, and Binyavanga Wainaina.</p>\n<p>The collection will be released in time for the announcement of the award in July 2009.</p>\n<p><b>This year's shortlist:</b></p>\n<p>*&nbsp; <b>Mamle Kabu</b> (Ghana), 'The End of Skill from Dreams,' from <i>Miracles and Jazz</i>, published by Picador Africa, Johannesburg 2008</p>\n<p>* <b>Parselelo Kantai</b> (Kenya), 'You Wreck Her,' from the <i>St Petersburg Review</i>, NY 2008</p>\n<p>* <b>Alistair Morgan</b> (South Africa), 'Icebergs,' from <i>The Paris Review</i> no.<br>\n183, NY 2008</p>\n<p>* <b>EC Osondu</b> (Nigeria), 'Waiting,' from <i>Guernicamag.com</i>, October 2008</p>\n<p>* <b>Mukoma wa Ngugi</b> (Kenya), 'How Kamau wa Mwangi Escaped into Exile,' from <i>Wasafiri</i> No54, Summer 2008, London</p>"},{"bookName":"Traditions in World Literature: Literature of Africa, Softcover Student Edition","author":"McGraw-Hill, McGraw-Hill Staff","ISBN_API":9780844212029,"year":"January 1999","description":""},{"bookName":"Love Child","author":"Gcina Mhlophe","ISBN_API":9781869140014,"year":"March 2002","description":"<p>Gcina Mhlophe is a poet, playwright, performer and South Africa's favorite storyteller. In this fascinating retrospective collection, she shares her personal journey through the social and political landscapes of the 1980s, with its recollected moments of struggle and transformation along the way. Written in a variety of styles and voices, ranging from anecdotal memory to historical moment to folklore tradition, these simply presented poems and stories are by turns funny, touching, chilling, thought-provoking and absorbing. Love Child is a collection for the new millennium generation. It is valuable not just for the deeply-felt personal and political insights it has to offer, but for the accessible ease with which it manages to capture the seminal moments of black South African history in the preserving amber of the author's personal recollection.</p>"},{"bookName":"Seventh Street Alchemy 2004: A Selection of Works from the Caine Prize for African Writing","author":"Jacana Media (Manufactured by), Monica Arac de Nyeko, Doreen Baingana, Parselelo Kantai","ISBN_API":9781770091450,"year":"June 2006","description":"<p>The 2004 winner of the Caine Prize for African Writing, Brian Chikwava's \"Seventh Street Alchemy\" is featured alongside shortlisted stories from 2004, compositions from the Caine Prize's March 2005 Workshop for African Writers, and Charles Mungoshi's previously unpublished \"Letter from a Friend\" in this inspired collection of work from some of Africa's most promising young and new writers.<br>\n</p>"},{"bookName":"Women Writing Africa: The Southern Region: Volume 1","author":"Sheila Meintjes, Dorothy Driver (Editor), Sheila Meintjes (Editor), Margie Orford (Editor), Chiedza Musengezi","ISBN_API":9781558614062,"year":"December 2002","description":"<p>A landmark in scholarship and culture, this volume uncovers the stunning literary legacy of African women, heretofore all but invisible.</p>\n<p>Beginning with a Sesotho women’s lament song from 1842, this volume brings together poetry, songs, newspaper columns, political petitions, personal letters, and prison diaries, along with little-known works by writers such as Bessie Head, Doris Lessing, Yvonne Vera, Zoë Wicomb, and Nadine Gordimer. Each of the 120 texts in the volume is accompanied by a scholarly note that provides detailed background information, while an introductory essay sets the broader historical stage. Approximately one third of the texts are oral in origin, and few have previously been available in book form.</p>"},{"bookName":"Of Suffocated Hearts and Tortured Souls: Seeking Subjecthood through Madness in Francophone Women's","author":"ValZrie Orlando, Valzrie Orlando, Valrie Orlando","ISBN_API":9780739105627,"year":"December 2002","description":"<p>Female characters who suffer madness and insanity are strikingly prominent in novels by women writers of Africa and the Caribbean. To find out why there are so many \"suffocated hearts and tortured souls\" in this literature, Valerie Orlando, who has long studied Francophone text and culture, here closely reads the work of Aminata Sow Fall, Mariama Bâ, Myrian Warner-Vieyra, and Simone Schwarz-Bart, among others. In these women's novels, Orlando finds, madness is the manifestation of a split identity, and in this study she sets herself the task of interrogating the nature of that identity. Francophone women novelists of Africa and the Caribbean—though they come from countries whose unique experiences of colonialism, revolution, and postcolonial regimes have shaped specific and discrete cultures—express a common search for a meaningful relationship between their experience as women to the history and destiny of their nations. Only when \"woman\"' is understood not as an ahistorical object but as a subject whose lived body is entwined with political, cultural, and economic structures, Orlando argues, will insanity finally give way to clarity of being. Interweaving literary citations with theoretical discussion, Suffocated Hearts and Tortured Souls is just as much a masterful explication of profoundly affecting literary work as it is an essential addition to feminist scholarship and theory.</p>"},{"bookName":"Less Than One and Double: A Feminist Reading of African Women's Writing","author":"Kenneth W. Harrow","ISBN_API":9780325070254,"year":"November 2001","description":"Harrow's provocative book introduces a psychoanalytic dimension to the study of African women's writing. In so doing, he opens up relatively uncharted terrain in African literary studies."},{"bookName":"The Rienner Anthology of African Literature","author":"Anthonia C. Kalu","ISBN_API":9781588264916,"year":"April 2007","description":""},{"bookName":"Oral and Written Expressions of African Cultures","author":"Toyin Falola, Fallou Ngom","ISBN_API":9781594606472,"year":"March 2009","description":"<p>Oral and Written Expressions of African Cultures challenges the traditional view of exotic and atavistic Africa with a balanced examination of the continent's realities and challenges. It shows how oral and written expressions capture the complexity, concerns, dynamism, challenges and ingenuity of African masses. It brings together twelve scholars from different academic backgrounds who draw from the rich repertoire of music, poetry, literature and the media in the continent to unearth the underlying socio-cultural, economic and political factors that shape African societies in the twenty first century. These scholars discuss issues ranging from political manipulations of popular music in Kenya and Argentina, the role of print media in the democratization process in Nigeria, motivations of \"vulgar poetry\" in South Africa, contemporary gender issues in the Islamic Republic of Sudan, the perseverance of aspects of African cultures in Puerto Rico, misrepresentations of Africa in Rene Maran's Batouala, the function of \"lowbrow fiction\" in Apartheid South Africa, female African authors' techniques to counter male dominance, to HIV/AID and the cultural taboos associated with the disease in southern Africa, among others.</p>"},{"bookName":"Jambula Tree and other stories: The Caine Prize for African Writing 8th Annual Collection","author":"Monica Arac de Nyeko","ISBN_API":9781904456735,"year":"July 2008","description":"<p>The Caine Prize for African Writing is Africa’s leading literary prize and is awarded to a short story by an African writer published in English, whether in Africa or elsewhere. Each year, the full shortlist and twelve other stories are collected and published in one volume.</p>\n<p>This year’s winner is Monica Arac de Nyeko for <i>Jambula Tree</i>, described as “a witty and touching portrait of a community which is affected forever by a love which blossoms between two adolescents.”</p>\n<p>Previous winners and entrants include Segun Afolabi, Leila Aboulela, Chimamanda Ngozi Adichie, Brian Chikwava, Mary Watson, and Binyavanga Wainaina.</p>"},{"bookName":"Up the Down Escalator","author":"Linda Rode, Hans Bodenstein","ISBN_API":9780795701061,"year":"March 2010","description":""},{"bookName":"Basali!: Stories by and about Women in Lesotho","author":"K. Limakatso Kendall","ISBN_API":9780869809181,"year":"February 1995","description":"Basali! means 'women' and is one of the most common exclamations in the Sesotho language. Usually uttered by a woman and delivered with a laugh, a shaking of the head, or a clapping of hands, Basali! evokes Basotho women's admiration and wonderment for themselves and each other. These stories in 'Sesotho-ised' English reveal a way of life and a way of perceiving experience that is unique in African literature. The stories offer glimpses of traditional healers, circumcision schools, witches, bride-prices, and extended rural family life. There are families disrupted by migrant labour, women and men brutalised by apartheid, teenagers who violate tradition, and middle-class office-workers whose rural families live by a different click than the one that ticks for them. The focus of each story is the decisions women make, the actions they take to protect and to provide for themselves and their children, and to care for the people they love."},{"bookName":"How God Fix Jonah","author":"Lorenz Graham, Ashley Bryan (Illustrator), Effie Lee Morris","ISBN_API":9781563976988,"year":"October 2000","description":"<p>\"Utterly delightful\" is how Zora Neal Hurston described this classic book when it was first published in 1946. Long out of print, Lorenz Graham's beautiful collection of Bible stories, told in the idiom of West Africa, is available again in an expanded edition newly illustrated by Ashley Bryan.</p>"},{"bookName":"Glass Jars among Trees","author":"Arja Salafranca (Editor), Alan Finlay","ISBN_API":9781919931234,"year":"April 2005","description":"This genre-shattering anthology includes writings in a variety of styles by pensioners, prisoners, schoolchildren, drifting teenagers, praise-singers, and even a few poets.<br>"},{"bookName":"Running Towards Us: New Writing from South Africa","author":"Isabel Balseiro (Editor), Isabel Balseiro","ISBN_API":9780325002118,"year":"May 2000","description":"In Running Towards Us, 31 contemporary authors offer literary responses to the end of apartheid, demonstrating what the creative imagination in South Africa has to offer at the turn of the 21st century."},{"bookName":"Of Suffocated Hearts And Tortured Souls","author":"Valerie Key Orlando","ISBN_API":9780739105634,"year":"December 2002","description":""},{"bookName":"An Anthology of Interracial Literature: Black-White Contacts in the Old World and the New","author":"Werner Sollors (Editor), Werner Sollors","ISBN_API":9780814781449,"year":"February 2004","description":""},{"bookName":"Among the Blacks","author":"Ron Padgett, Raymond Roussel","ISBN_API":9780939691029,"year":"October 1988","description":"<br>\nFiction. African American Studies. Translated from the French. AMONG THE BLACKS consists of two works: Ron Padgett's translation of Raymond Roussel's early story \"Parmi les noirs,\" first published in 1935 in his book Comment j'ai ecrit certain de mes livres, together with Padgett's memoir focusing upon his own experience among black people. Roussel's story, about a master mariner named White who encounters an African chief named Booltable, is built upon the kind of whimsical and extravagant word play (its first and last sentences are identical except for one letter in one word--\"pooltable\"/ \"Booltable\") for which Roussel was idolized by the French Surrealists. In contrast, as he writes in his Afterword, Padgett's memoir \"grew out of the nagging need to come to grips with the frustrations of being a white American who had grown up in a racist environment and who, despite his rejections of racism at an early age, had rarely felt unselfconscious in the company of a black person.\" \"What he leaves us with is a work that is like the perfectly preserved temple of a cult which has disappeared without a trace, or a complicated set of tools whose use cannot be discovered. But even though we may never be able to 'use' [Roussel's] work in the way he hoped, we can still admire its inhuman beauty, and be stirred by a language that seems always on the point of revealing its secret, of pointing the way back to the 'republic of dreams' whose insignia blazed on his forehead\"--John Ashbery."},{"bookName":"The Daily Show with Jon Stewart Presents Earth (the Book): A Visitor's Guide to the Human Race","author":"Jon Stewart","ISBN_API":9780446579223,"year":"September 2010","description":"<p>The eagerly awaited new book from the Emmy-winning, Oscar-hosting, <b>Daily Show-</b>anchoring Jon Stewart—the man behind the megaseller <b>America (The Book)</b>.</p>\n<p>Where do we come from? Who created us? Why are we here? These questions have puzzled us since the dawn of time, but when it became apparent to Jon Stewart and the writers of <b>The Daily Show</b> that the world was about to end, they embarked on a massive mission to write a book that summed up the human race: What we looked like; what we accomplished; our achievements in society, government, religion, science and culture — all in a tome of approximately 256 pages with lots of color photos, graphs and charts.</p>\n<p>After two weeks of hard work, they had their book. EARTH (The Book) is the definitive guide to our species. With their trademark wit, irreverence, and intelligence, Stewart and his team will posthumously answer all of life's most hard-hitting questions, completely unburdened by objectivity, journalistic integrity, or even accuracy.</p>\n<p>Also available as an ebook and as an audiobook.</p>"},{"bookName":"The Best American Nonrequired Reading 2010","author":"Dave Eggers (Editor), David Sedaris","ISBN_API":9780547241630,"year":"October 2010","description":"<p>An&nbsp;eclectic volume introduced by David Sedaris and compiled by Dave Eggers and students of his San Francisco writing center, who don’t leave a stone unturned in their search for nonrequired gems.&nbsp;Cover art by art by Maurice Sendak.</p>"},{"bookName":"The Daily Show with Jon Stewart Presents Earth (the Book): A Visitor's Guide to the Human Race","author":"Jon Stewart","ISBN_API":9781607886150,"year":"October 2010","description":""},{"bookName":"100 Best-Loved Poems","author":"Philip Smith","ISBN_API":9780486285535,"year":"May 1995","description":"Popular, well-known poetry: \"The Passionate Shepherd to His Love,\" \"Shall I compare thee to a summer's day?\" \"Death, be not proud,\" \"The Raven,\" \"The Road Not Taken,\" plus works by Blake, Wordsworth, Byron, Coleridge, Shelley, Emerson, Browning, Keats, Kipling, Sandburg, Pound, Auden, Thomas, and many others. Includes 13 selections from the Common Core State Standards Initiative."},{"bookName":"The Norton Anthology of American Literature, Shorter Seventh Edition, One-Volume Paperback","author":"Wayne Franklin (Editor), Jerome Klinkowitz (Editor), Mary Loeffelholz (Editor), Arnold Krupat (Editor), Philip F. Gura","ISBN_API":9780393930573,"year":"July 2007","description":"Under Nina Baym's direction, the editors have considered afresh each selection and the entire apparatus to make the Shorter Edition an even better teaching tool for the one-semester and brief two-semester courses.<br>"},{"bookName":"The Best American Poetry 2009","author":"David Wagoner (Editor), David Lehman","ISBN_API":9781615521647,"year":"September 2009","description":""},{"bookName":"The Oxford Book of American Short Stories","author":"Joyce Carol Oates","ISBN_API":9780195092622,"year":"September 1994","description":""},{"bookName":"The Best American Essays 2009","author":"Mary Oliver (Editor), Robert Atwan (Editor), Mary Oliver","ISBN_API":9780618982721,"year":"October 2009","description":"<p>Edited by award-winning poet and essayist Mary Oliver, the latest edition of this \"rich and thoughtful collection\" (<i>Publishers Weekly</i>) offers the finest essays \"judiciously selected from countless publications\" (<i>Chicago Tribune</i>).</p>"},{"bookName":"The Norton Anthology of American Literature, Package 2: Volumes C, D, and E","author":"Jerome Klinkowitz (Editor), Robert Levine (Editor), Mary Loeffelholz (Editor), Arnold Krupat (Editor), Patricia Wallace","ISBN_API":9780393929942,"year":"April 2007","description":"<p><b>Firmly grounded in the core strengths that have made it the best-selling undergraduate survey in the field,</b> The Norton Anthology of American Literature has been revitalized in this Seventh Edition through the collaboration between three new period editors and five seasoned ones.</p>\n<p>Under Nina Baym’s direction, the editors have considered afresh each selection and all the apparatus to make the anthology an even better teaching tool.</p>"},{"bookName":"Early African American Classics (Barnes &amp; Noble Classics Series)","author":"Barnes & Noble","ISBN_API":9781400500284,"year":"October 2008","description":"Culled from the annals of early African American history, these personal narratives recount the stories of men and women who survived the cruel injustice of slavery to become prominent leaders in the struggle for freedom and equality.\n<ul>\n<li><i>Incidents in the Life of a Slave Girl</i> by Harriet Jacobs</li>\n<li><i>Narrative of Sojourner Truth</i> by Sojourner Truth</li>\n<li><i>Narrative of the Life of Frederick Douglass, an American Slave</i> by Frederick Douglass,</li>\n<li><i>The Souls of Black Folk</i> by W.E.B. Du Bois</li>\n<li><i>My Bondage and My Freedom</i> by Frederick Douglass</li>\n<li><i>Great Escapes: Four Slave Narratives</i></li>\n</ul>\nThe <a href=\"http://www.barnesandnoble.com/classics/index.asp?z=y&amp;cds2Pid=16447&amp;sLinkPrefix\"><i>Barnes &amp; Noble Classics</i></a> series offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of <i>Barnes &amp; Noble Classics</i>: \n<ul>\n<li>New introductions commissioned from today's top writers and scholars</li>\n<li>Biographies of the authors</li>\n<li>Chronologies of contemporary historical, biographical, and cultural events</li>\n<li>Footnotes and endnotes</li>\n<li>Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work</li>\n<li>Comments by other famous authors</li>\n<li>Study questions to challenge the reader's viewpoints and expectations</li>\n<li>Bibliographies for further reading</li>\n<li>Indices &amp; Glossaries, when appropriate</li>\n</ul>\nAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. <i>Barnes &amp; Noble Classics</i> pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works."},{"bookName":"African-American Poetry: An Anthology, 1773-1930","author":"Joan R. Sherman","ISBN_API":9780486296043,"year":"July 1997","description":"Rich selection of 74 poems ranging from the religious and moral verse of Phillis Wheatley Peters (ca. 1753–1784) to 20th-century work of Langston Hughes and Countee Cullen. Other contributors include James Weldon Johnson, Paul Laurence Dunbar, many others. Indispensable for students of the black experience in America and any lover of fine poetry. Includes 4 selections from the Common Core State Standards Initiative."},{"bookName":"Couldn't Keep It to Myself: Testimonies from Our Imprisoned Sisters","author":"Wally Lamb, Diane Bartholomew, Nancy Birkla, Robin Cullen, Brenda Medina","ISBN_API":9780060595371,"year":"February 2004","description":"<p>In a stunning work of insight and hope, <em>New York Times</em> bestselling author Wally Lamb once again reveals his unmatched talent for finding humanity in the lost and lonely and celebrates the transforming power of the written word.</p>\n<p>For several years, Lamb has taught writing to a group of women prisoners at York Correctional Institution in Connecticut. In this unforgettable collection, the women of York describe in their own words how they were imprisoned by abuse, rejection, and their own self-destructive impulses long before they entered the criminal justice system. Yet these are powerful stories of hope and healing, told by writers who have left victimhood behind.</p>\n<p>In his moving introduction, Lamb describes the incredible journey of expression and self-awareness the women took through their writing and shares how they challenged him as a teacher and as a fellow author. <em>Couldn't Keep It to Myself</em> is a true testament to the process of finding oneself and working toward a better day.</p>"},{"bookName":"The Norton Anthology of Poetry, Shorter 5th Edition","author":"Margaret Ferguson (Editor), Jon Stallworthy (Editor), Mary Jo Salter (Editor), Mary Jo Salter (Editor), Jon Stallworthy","ISBN_API":9780393979213,"year":"December 2004","description":"<p><b>Offering over one thousand years of verse from the medieval period to the present,</b> The Norton Anthology of Poetry is the classroom standard for the study of poetry in English.</p>\n<p>The Fifth Edition retains the flexibility and breadth of selection that has defined this classic anthology, while improved and expanded editorial apparatus make it an even more useful teaching tool.</p>"},{"bookName":"The Best American Poetry 2010","author":"Amy Gerstler (Editor), David Lehman","ISBN_API":9781439181454,"year":"September 2010","description":"<p>AMY GERSTLER’S COMMITMENT TO INNOVATIVE POETRY that conveys meaning, feeling, wit, and humor informs the cross section of poems in the 2010 edition of <i>The Best American Poetry.</i> The works collected here represent the wealth, the breadth, and the tremendous energy of poetry in the United States today. Featuring poems from some of our country’s top bards, including John Ashbery, Anne Carson, Louise Glück, Sharon Olds, and Charles Simic, <i>The Best American Poetry 2010</i> also presents poems that poignantly capture the current moment, such as the sonnets John Updike wrote to chronicle his dying weeks. And there are exciting poems from a constellation of rising stars: Bob Hicok, Terrance Hayes, Denise Duhamel, Dean Young, and Elaine Equi, to name a very few.</p>\n<p>The anthology’s mainstays are in place: It opens with series editor David Lehman’s incisive foreword about the state of American poetry and has a marvelous introduction by Amy Gerstler. Notes from the poets, illuminating their poems and their writing processes, conclude this delightful addition to a classic series.</p>\n<p>Dick Allen • John Ashbery • Sandra Beasley • Mark Bibbins • Todd Boss • Fleda Brown • Anne Carson • Tom Clark • David Clewell • Michael Collier • Billy Collins • Dennis Cooper • Kate Daniels • Peter Davis • Tim Dlugos • Denise Duhamel • Thomas Sayers Ellis • Lynn Emanuel • Elaine Equi • Jill Alexander Essbaum • B. H. Fairchild • Vievee Francis • Louise Glück • Albert Goldbarth • Amy Glynn Greacen • Sonia Greenfield • Kelle Groom • Gabriel Gudding • Kimiko Hahn • Barbara Hamby • Terrance Hayes • Bob Hicok • Rodney Jones • Michaela Kahn • Brigit Pegeen Kelly • Corinne Lee • Hailey Leithauser • Dolly Lemke • Maurice Manning • Adrian Matejka • Shane McCrae • Jeffrey McDaniel • W. S. Merwin • Sarah Murphy • Eileen Myles • Camille Norton • Alice Notley • Sharon Olds • Gregory Pardlo • Lucia Perillo • Carl Phillips • Adrienne Rich • James Richardson • J. Allyn Rosser • James Schuyler • Tim Seibles • David Shapiro • Charles Simic • Frank Stanford • Gerald Stern • Stephen Campbell Sutherland • James Tate • David Trinidad • Chase Twichell • John Updike • Derek Walcott • G. C. Waldrep • J. E. Wei • Dara Wier • Terence Winch • Catherine Wing • Mark Wunderlich • Matthew Yeager • Dean Young • Kevin Young</p>"},{"bookName":"Classic Slave Narratives: The Life of Olaudah Equiano, The History of Mary Prince, Narrative of the Life of Frederick Douglass, Incidents in the Life of a Slave Girl","author":"Henry Louis Gates Jr. (Editor), Frederick Douglass, Olaudah Equiano, Harriet Jacobs, Mary Prince","ISBN_API":9780451528247,"year":"January 2002","description":"<p>No group of slaves anywhere, in any era, has left such prolific testimony to the horror of bondage as African-American slaves. Here are four of the most notable narratives: <i>The Life of Olaudah Equiano; The History of Mary Prince; Narrative of the Life of Frederick Douglass;</i> and <i>Incidents in the Life of Slave Girl</i>.</p>\n\n\n                        <p>Along with the writings of Frederick Douglas and Olaudah Equiano, this anthology includes the writings of women slaves Harriet Jacobs and Mary Prince.\n</p>"},{"bookName":"The Best American Nonrequired Reading 2009","author":"Dave Eggers (Editor), Marjane Satrapi","ISBN_API":9780547241609,"year":"October 2009","description":"<p>This \"great volume\" highlights the \"very best of this year's fiction, nonfiction, alternative comics, screenplys, blogs and more\" (<i>OK!).</i> Compiled by Dave Eggers and students from his San Francisco writing center, it is \"both uproarious and illuminating\" (<i>Publishers Weekly).</i></p>"},{"bookName":"In Fact: The Best of Creative Nonfiction","author":"Lee Gutkind (Editor), Annie Dillard","ISBN_API":9780393326659,"year":"November 2004","description":"<p class=\"null1\">Twenty-five arresting selections from the groundbreaking journal that defined a genre.</p>\n<p>Creative nonfiction, also known as narrative nonfiction, liberated journalism by inviting writers to dramatize, interpret, speculate, and even re-create their subjects. Lee Gutkind collects twenty-five essays that flourished on this new ground, all originally published in the journal he founded, <b>Creative Nonfiction</b>, now celebrating its tenth anniversary. Lauren Slater is a therapist in the institution where she was once a patient. John Edgar Wideman reacts passionately to the unjust murder of Emmett Till. Charles Simic tells of wild nights with Uncle Boris. John McPhee creates a rare, personal, album quilt. Terry Tempest Williams speaks on the decline of the prairie dog. Madison Smartt Bell invades Haiti. Many of the writers are crossing genres—from poetry and fiction to nonfiction—symbolic of <b>Creative Nonfiction's</b> scope and popularity. A cross section of the famous and those bound to become so, this collection is a riveting experience highlighting the expanding importance of this dramatic and exciting new genre.</p>"},{"bookName":"The Best American Essays of the Century","author":"Joyce Carol Oates, Robert Atwan","ISBN_API":9780618155873,"year":"October 2001","description":"<p>This singular collection is nothing less than a political, spiritual, and intensely personal record of America’s tumultuous modern age, as experienced by our foremost critics, commentators, activists, and artists. Joyce Carol Oates has collected a group of works that are both intimate and important, essays that move from personal experience to larger significance without severing the connection between speaker and audience.<br>\n From Ernest Hemingway covering bullfights in Pamplona to Martin Luther King, Jr.’s “Letter from Birmingham Jail,” these essays fit, in the words of Joyce Carol Oates, “into a kind of mobile mosaic suggest[ing] where we’ve come from, and who we are, and where we are going.” Among those whose work is included are Mark Twain, John Muir, T. S. Eliot, Richard Wright, Vladimir Nabokov, James Baldwin, Tom Wolfe, Susan Sontag, Maya Angelou, Alice Walker, Joan Didion, Cynthia Ozick, Saul Bellow, Stephen Jay Gould, Edward Hoagland, and Annie Dillard.</p>"},{"bookName":"The Best Loved Poems of the American People","author":"Hazel Felleman (Selected by), Edward Frank Allen (Introduction), Hazel Felleman","ISBN_API":9780385000192,"year":"October 1936","description":"More than 1,500,000 copies in print! Over 575&nbsp;&nbsp;traditional favorites to be read and reread.&nbsp;&nbsp;Categorized by theme, and indexed by author and first&nbsp;&nbsp;line, this is a collection that will be treasured."},{"bookName":"The Norton Anthology of American Literature: Volume A: Beginnings to 1820","author":"Wayne Franklin (Editor), Jerome Klinkowitz (Editor), Arnold Krupat (Editor), Philip F. Gura (Editor), Bruce Michelson","ISBN_API":9780393927399,"year":"April 2007","description":"<p><b>Firmly grounded in the core strengths that have made it the best-selling undergraduate survey in the field,</b> The Norton Anthology of American Literature has been revitalized in this Seventh Edition through the collaboration between three new period editors and five seasoned ones.</p>\n<p>Under Nina Baym’s direction, the editors have considered afresh each selection and all the apparatus to make the anthology an even better teaching tool.</p>"},{"bookName":"The Norton Anthology of Poetry","author":"Margaret Ferguson, Jon Stallworthy, Mary Jo Salter, Jon Stallworthy (Editor), Mary Jo Salter","ISBN_API":9780393979206,"year":"December 2004","description":"<p><b>Offering over one thousand years of verse from the medieval period to the present,</b> The Norton Anthology of Poetry is the classroom standard for the study of poetry in English.</p>\n<p>The Fifth Edition retains the flexibility and breadth of selection that has defined this classic anthology, while improved and expanded editorial apparatus make it an even more useful teaching tool.</p>"},{"bookName":"The Norton Anthology of African American Literature, Vol. 2","author":"Henry Louis Gates Jr. (Editor), Nellie Y. McKay","ISBN_API":9780393977783,"year":"December 2003","description":"<p><b>Welcomed on publication as \"brilliant, definitive, and a joy to teach from,\"</b> The Norton Anthology of African American Literature was adopted at more than 1,275 colleges and universities worldwide. Now, the new Second Edition offers these highlights.</p>"},{"bookName":"Poems, Poets, Poetry: An Introduction and Anthology","author":"Helen Vendler","ISBN_API":9780312463199,"year":"October 2009","description":"<br>\nMany students today are puzzled by the meaning and purpose of poetry. <i>Poems, Poets, Poetry</i> demystifies the form and introduces students to its artistry and pleasures, using methods that Helen Vendler has successfully used herself over her long, celebrated career. Guided by Vendler’s erudite yet down-to-earth approach, students at all levels can benefit from her authoritative instruction. Her blend of new and canonical poets includes the broadest selection of new and multi-racial poets offered by any introductory text. Comprehensive and astute, this text engages students in effective ways of reading — and taking delight in — poetry."},{"bookName":"The Poets Laureate Anthology","author":"Elizabeth Hun Schmidt, Library of Congress Staff (With), Billy Collins","ISBN_API":9780393061819,"year":"October 2010","description":"<p class=\"null1\">The first anthology to gather poems by the forty-three poets laureate of the United States.</p>\n<p>As a record of poetry, <b>The Poets Laureate Anthology</b> is groundbreaking, charting the course of American poetry over the last seventy-five years, while being, at the same time, a pleasure to read, full of some of the world’s best-known poems and many new surprises. Elizabeth Hun Schmidt has gathered and introduced poems by each of the forty-three poets who have been named our nation’s poets laureate since the post (originally called Consultant in Poetry to the Library of Congress) was established in 1937. Poets range from Robert Pinsky, William Carlos Williams, and Elizabeth Bishop to Charles Simic, Billy Collins, and Rita Dove. Schmidt’s spirited introductions place the poets and their poems in historical and literary context and shine light on the interesting and often uneasy relationship between politics and art. This is an inviting, monumental collection for everyone’s library, containing much of the best poetry written in America over the last century.</p>"},{"bookName":"The Portable Beat Reader","author":"Various, Ann Charters","ISBN_API":9780142437537,"year":"July 2003","description":""},{"bookName":"The Best American Short Plays 2008-2009","author":"Barbara Parisi","ISBN_API":9781557837608,"year":"October 2010","description":"<p>This edition of the highly esteemed and long-enduring Best American Short Plays series contains fresh-voiced, cutting-edge plays by nineteen playwrights, both established and among the most promising of the new millennium. Each of these plays reflects the enormous diversity of contemporary American theatre.</p>"},{"bookName":"The Gift of Love","author":"Lori Foster, Gia Dawn, Ann Christopher, Lisa Cooke, Heidi Betts","ISBN_API":9780425234280,"year":"June 2010","description":"<p><b>Edited by <i>New York Times</i> bestselling author Lori Foster-a heartwarming anthology of all-new stories that celebrate family love.</b></p>\n<p>Families come in many configurations, and every one is unique, made up of the personalities of each member. But the love that connects families is universal. Whether it is the love of parents for their children, the love between a husband and wife, the love between siblings, a love that transcends generations, or even the love for a family member never met, the family ties that bind us are the strongest and deepest emotional connections we experience. Families influence a person's development, how they treat others, and how they view life. In <i>The Gift of Love</i>, eight exceptional writers offer a variety of unique perspectives on what family love means and how it impacts our lives in ways profound and often surprising.</p>\n<p>Featuring:</p>\n<p>Lori Foster ? Heidi Betts ? Jules Bennett ? Ann Christopher ? Lisa Cooke ? Paige Cuccaro ? Gia Dawn ? Helen Kay Dimon</p>"},{"bookName":"One Hundred and One Famous Poems (Barnes &amp; Noble Library of Essential Reading)","author":"Roy J. Cook","ISBN_API":9781435114760,"year":"February 2009","description":""},{"bookName":"The Vintage Book of Contemporary American Poetry","author":"J. D. McClatchy","ISBN_API":9781400030934,"year":"April 2003","description":"<p>Dazzling in its range, exhilarating in its immediacy and grace, this collection gathers together, from every region of the country and from the past forty years, the poems that continue to shape our imaginations. From Robert Lowell and Elizabeth Bishop, John Ashbery and Adrienne Rich, to Robert Haas and Louise Gluck, this anthology takes the full measure of our poetry's daring energies and its tender understandings.</p>"},{"bookName":"Literature: A Pocket Anthology","author":"R. S. Gwynn","ISBN_API":9780205655106,"year":"January 2009","description":""},{"bookName":"I'll Fly Away: Further Testimonies from the Women of York Prison","author":"Wally Lamb, I'll Fly Away Contributors","ISBN_API":9780061626395,"year":"October 2008","description":"<p>For several years, Wally Lamb, the author of two of the most beloved novels of our time, has run a writing workshop at the York Correctional Institution, Connecticut's only maximum-security prison for women. Writing, Lamb discovered, was a way for these women to face their fears and failures and begin to imagine better lives. <b>Couldn't Keep It to Myself</b>, a collection of their essays, was published in 2003 to great critical acclaim. With <b>I'll Fly Away</b>, Lamb offers readers a new volume of intimate pieces from the York workshop. Startling, heartbreaking, and inspiring, these stories are as varied as the individuals who wrote them, but each illuminates an important core truth: that a life <b>can</b> be altered through self-awareness and the power of the written word.</p>"}]